{
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "tilzi1px6-en"
      },
      "source": [
        "### Setup and Installation"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 25,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "MzcNpxmCDV5S",
        "outputId": "5a9da0e0-8376-47e5-befa-ab1e28be4dc2"
      },
      "outputs": [],
      "source": [
        "# !pip install langchain -q\n",
        "# !pip install langchain-community -q\n",
        "# !pip install langchain-experimental -q\n",
        "# !pip install neo4j -q\n",
        "# !pip install langchain-chroma -qU\n",
        "# !pip install langchain-google-genai -qU"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [],
      "source": [
        "\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [],
      "source": []
    },
    {
      "cell_type": "code",
      "execution_count": 26,
      "metadata": {
        "id": "4WPME5uVUcA8"
      },
      "outputs": [],
      "source": [
        "# from google.colab import userdata\n",
        "# import os\n",
        "\n",
        "# import warnings\n",
        "# warnings.filterwarnings('ignore')"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "sWUOAh_KOcyN"
      },
      "source": [
        "### Initialize OpenAI LLM"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 27,
      "metadata": {
        "id": "vrAyMhQFTl6-"
      },
      "outputs": [],
      "source": [
        "from langchain_google_genai import ChatGoogleGenerativeAI\n",
        "import os\n",
        "\n",
        "os.environ[\"GOOGLE_API_KEY\"] = \"AIzaSyBcUsfH8V9z9ES0SVlYRAZAY_Lp2AdO800\"\n",
        "\n",
        "from langchain_google_genai import GoogleGenerativeAI\n",
        "llm=GoogleGenerativeAI(\n",
        "    model=\"gemini-2.5-flash\", temperature=0.1\n",
        "    )"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "ihDeEiUiOgcA"
      },
      "source": [
        "### Initialize Embedding Model"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 28,
      "metadata": {
        "id": "bBBldP__UHa2"
      },
      "outputs": [],
      "source": [
        "from langchain_google_genai import GoogleGenerativeAIEmbeddings\n",
        "\n",
        "embedding=GoogleGenerativeAIEmbeddings(model=\"models/embedding-001\")"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "LCSECXmeZDcA"
      },
      "source": [
        "### Load Data"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 29,
      "metadata": {
        "id": "GghHAbEEZIB5"
      },
      "outputs": [],
      "source": [
        "from langchain.schema import Document\n",
        "\n",
        "text = Document(page_content=\"\"\"\n",
        "Three students, A, B, and C, are tackling two subjects, Mathematics(X) and Literature(Y). Each has a unique perspective, weaving their experiences into a shared academic journey. A, gifted in Mathematics, thrives on solving equations but struggles with the abstract world of poetry and storytelling. On the other hand, B shines in Literature, captivating others with a flair for creative writing, yet finds numbers daunting and formulas perplexing.\n",
        "C, a generalist, performs decently in both subjects but often bridges gaps between A and B. While A helps B understand mathematical concepts, B guides A through essay writing. Meanwhile, C organizes group study sessions, offering real-world examples to connect ideas from X and Y, making both subjects more relatable. Their collaboration not only enhances their learning but fosters a sense of camaraderie, demonstrating the power of teamwork in overcoming challenges.\n",
        "\"\"\")"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "J9PlVSJCOnaO"
      },
      "source": [
        "### Split Documents into Chunks"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 30,
      "metadata": {
        "id": "OohL4NZSU6qv"
      },
      "outputs": [],
      "source": [
        "from langchain.text_splitter import RecursiveCharacterTextSplitter\n",
        "\n",
        "splitter = RecursiveCharacterTextSplitter(chunk_size=250,chunk_overlap=30)\n",
        "\n",
        "chunks = splitter.split_documents([text])"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [],
      "source": [
        "\n"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "QEYxWeN27RAw"
      },
      "source": [
        "### Graph Initialization and Transformation"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 32,
      "metadata": {
        "id": "NXWVawDlVOtT"
      },
      "outputs": [],
      "source": [
        "from langchain_community.graphs import Neo4jGraph\n",
        "\n",
        "os.environ[\"NEO4J_URI\"] = \"neo4j+s://d7d4b5b1.databases.neo4j.io\"\n",
        "os.environ[\"NEO4J_USERNAME\"] = \"neo4j\"\n",
        "os.environ[\"NEO4J_PASSWORD\"] = \"POPst623dzIc8xW777nPvf6MJl91QhlGcAzXhOpOa-w\"\n",
        "\n",
        "# initialize Neo4j graph database\n",
        "graph = Neo4jGraph()"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 33,
      "metadata": {
        "id": "zuvAeybfVYHT"
      },
      "outputs": [],
      "source": [
        "from langchain_experimental.graph_transformers import LLMGraphTransformer\n",
        "\n",
        "graph_transformer = LLMGraphTransformer(llm = llm)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 34,
      "metadata": {
        "id": "RLtcJajPVZ1D"
      },
      "outputs": [],
      "source": [
        "# convert text chunks to graph nodes\n",
        "graph_documents = graph_transformer.convert_to_graph_documents(chunks)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 35,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "FEh98FI-2B04",
        "outputId": "196a2358-fb45-48e6-dcb5-11417a6956ae"
      },
      "outputs": [
        {
          "data": {
            "text/plain": [
              "GraphDocument(nodes=[Node(id='C', type='Person', properties={}), Node(id='A', type='Person', properties={}), Node(id='gifted in Mathematics', type='Characteristic', properties={}), Node(id='Mathematics', type='Subject', properties={}), Node(id='Literature', type='Subject', properties={}), Node(id='B', type='Person', properties={}), Node(id='thrives on solving equations', type='Characteristic', properties={})], relationships=[Relationship(source=Node(id='A', type='Person', properties={}), target=Node(id='Mathematics', type='Subject', properties={}), type='TACKLES', properties={}), Relationship(source=Node(id='A', type='Person', properties={}), target=Node(id='Literature', type='Subject', properties={}), type='TACKLES', properties={}), Relationship(source=Node(id='B', type='Person', properties={}), target=Node(id='Mathematics', type='Subject', properties={}), type='TACKLES', properties={}), Relationship(source=Node(id='B', type='Person', properties={}), target=Node(id='Literature', type='Subject', properties={}), type='TACKLES', properties={}), Relationship(source=Node(id='C', type='Person', properties={}), target=Node(id='Mathematics', type='Subject', properties={}), type='TACKLES', properties={}), Relationship(source=Node(id='C', type='Person', properties={}), target=Node(id='Literature', type='Subject', properties={}), type='TACKLES', properties={}), Relationship(source=Node(id='A', type='Person', properties={}), target=Node(id='gifted in Mathematics', type='Characteristic', properties={}), type='HAS_CHARACTERISTIC', properties={}), Relationship(source=Node(id='A', type='Person', properties={}), target=Node(id='thrives on solving equations', type='Characteristic', properties={}), type='HAS_CHARACTERISTIC', properties={})], source=Document(metadata={}, page_content='Three students, A, B, and C, are tackling two subjects, Mathematics(X) and Literature(Y). Each has a unique perspective, weaving their experiences into a shared academic journey. A, gifted in Mathematics, thrives on solving equations but struggles'))"
            ]
          },
          "execution_count": 35,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "graph_documents[0]"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 36,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "lKk2VRu95CeV",
        "outputId": "17653516-847d-4698-9db5-39dcace3c400"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "id='C' type='Person' properties={}\n",
            "id='A' type='Person' properties={}\n",
            "id='gifted in Mathematics' type='Characteristic' properties={}\n",
            "id='Mathematics' type='Subject' properties={}\n",
            "id='Literature' type='Subject' properties={}\n",
            "id='B' type='Person' properties={}\n",
            "id='thrives on solving equations' type='Characteristic' properties={}\n"
          ]
        }
      ],
      "source": [
        "for node in graph_documents[0].nodes:\n",
        "  print(node)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 37,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "OMhsYFIvVhVS",
        "outputId": "4b99e516-c97f-4a0b-a4d2-ff2792703277"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "source=Node(id='A', type='Person', properties={}) target=Node(id='Mathematics', type='Subject', properties={}) type='TACKLES' properties={}\n",
            "source=Node(id='A', type='Person', properties={}) target=Node(id='Literature', type='Subject', properties={}) type='TACKLES' properties={}\n",
            "source=Node(id='B', type='Person', properties={}) target=Node(id='Mathematics', type='Subject', properties={}) type='TACKLES' properties={}\n",
            "source=Node(id='B', type='Person', properties={}) target=Node(id='Literature', type='Subject', properties={}) type='TACKLES' properties={}\n",
            "source=Node(id='C', type='Person', properties={}) target=Node(id='Mathematics', type='Subject', properties={}) type='TACKLES' properties={}\n",
            "source=Node(id='C', type='Person', properties={}) target=Node(id='Literature', type='Subject', properties={}) type='TACKLES' properties={}\n",
            "source=Node(id='A', type='Person', properties={}) target=Node(id='gifted in Mathematics', type='Characteristic', properties={}) type='HAS_CHARACTERISTIC' properties={}\n",
            "source=Node(id='A', type='Person', properties={}) target=Node(id='thrives on solving equations', type='Characteristic', properties={}) type='HAS_CHARACTERISTIC' properties={}\n"
          ]
        }
      ],
      "source": [
        "for relationship in graph_documents[0].relationships:\n",
        "  print(relationship)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 38,
      "metadata": {
        "id": "Asm7LYVgVlAy"
      },
      "outputs": [],
      "source": [
        "# add nodes and relationships to graph\n",
        "graph.add_graph_documents(\n",
        "    graph_documents,\n",
        "    baseEntityLabel=True,\n",
        "    include_source=True\n",
        ")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 39,
      "metadata": {
        "id": "Uc8Mo8fXIpOa"
      },
      "outputs": [],
      "source": [
        "# indexing enables fast searches within text-based properties\n",
        "def create_fulltext_index(g):\n",
        "  cypher = \"CREATE FULLTEXT INDEX entity IF NOT EXISTS FOR (e:__Entity__) ON EACH [e.id]\"\n",
        "  g.query(cypher)\n",
        "\n",
        "create_fulltext_index(graph)"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "glvWsI-cOuyE"
      },
      "source": [
        "### Querying the Graph and Entity Retrieval"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 40,
      "metadata": {
        "id": "CVwz1sgAH8iC"
      },
      "outputs": [],
      "source": [
        "# from langchain_core.prompts import ChatPromptTemplate\n",
        "\n",
        "# entity_prompt = ChatPromptTemplate.from_messages(\n",
        "#     [\n",
        "#         (\n",
        "#             \"system\",\"You are extracting entities from the text.\",\n",
        "#         ),\n",
        "#         (\n",
        "#             \"human\",\"Use the following information to extract entities\"\n",
        "#             \"input: {question}\",\n",
        "#         ),\n",
        "#     ]\n",
        "# )\n",
        "\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 41,
      "metadata": {},
      "outputs": [],
      "source": [
        "from pydantic import BaseModel\n",
        "from typing import List\n",
        "\n",
        "class Entity(BaseModel):\n",
        "    type: str\n",
        "    value: str\n",
        "\n",
        "class Entities(BaseModel):\n",
        "    entities: List[Entity]"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 42,
      "metadata": {},
      "outputs": [],
      "source": [
        "from langchain_core.prompts import PromptTemplate\n",
        "\n",
        "entity_prompt = PromptTemplate.from_template(\"\"\"\n",
        "Extract named entities from the text below.\n",
        "Return the result **as JSON** with this format(types can be anithing you want, not only person,location, subject):\n",
        "\n",
        "{{\n",
        "  \"entities\": [\n",
        "    {{\"type\": \"PERSON\", \"value\": \"John\"}},\n",
        "    {{\"type\": \"LOCATION\", \"value\": \"Paris\"}}\n",
        "  ]\n",
        "}}\n",
        "\n",
        "Text: \"{question}\"\n",
        "\"\"\")\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 43,
      "metadata": {
        "id": "XGLLrMPcJ71i"
      },
      "outputs": [],
      "source": [
        "# from pydantic import BaseModel, Field\n",
        "# from typing import List\n",
        "\n",
        "# class Entities(BaseModel):\n",
        "#     names: List[str] = Field(\n",
        "#         ...,\n",
        "#         description=\"All the entities that appear in the text\",\n",
        "#     )"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [],
      "source": [
        "\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 44,
      "metadata": {},
      "outputs": [],
      "source": [
        "from langchain.output_parsers import PydanticOutputParser\n",
        "parser = PydanticOutputParser(pydantic_object=Entities)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 45,
      "metadata": {
        "id": "OvKwXkaNKcMx"
      },
      "outputs": [],
      "source": [
        "entity_chain = entity_prompt | llm | parser"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [],
      "source": []
    },
    {
      "cell_type": "code",
      "execution_count": 47,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "wAM8QQO7Khpa",
        "outputId": "403d2f10-27bd-4d89-d0c2-2e9489f83358"
      },
      "outputs": [
        {
          "data": {
            "text/plain": [
              "Entities(entities=[Entity(type='Subject', value='Mathematics(X)'), Entity(type='Subject', value='Literature(Y)')])"
            ]
          },
          "execution_count": 47,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "entity_chain.invoke({\"question\": \"who learn both Mathematics(X) and Literature(Y) subjects\"})"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "VYhF7SGE8xZ4"
      },
      "source": [
        "### Graph Retriever"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "0fkdU_J_LVU2"
      },
      "source": [
        "Lucene chars: https://api.python.langchain.com/en/latest/_modules/langchain_community/vectorstores/neo4j_vector.html#remove_lucene_chars"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 48,
      "metadata": {
        "id": "o7NBlIQkKxDf"
      },
      "outputs": [],
      "source": [
        "from langchain_community.vectorstores.neo4j_vector import remove_lucene_chars\n",
        "\n",
        "def generate_full_text_query(input):\n",
        "    full_text_query = \"\"\n",
        "    words = [el for el in remove_lucene_chars(input).split() if el]\n",
        "    for word in words[:-1]:\n",
        "        full_text_query += f\" {word}~2 AND\"\n",
        "    full_text_query += f\" {words[-1]}~2\"\n",
        "    return full_text_query.strip()\n",
        "\n",
        "def graph_retriever(question: str) -> str:\n",
        "    result = \"\"\n",
        "    entities = entity_chain.invoke({\"question\": question})\n",
        "    for entity in entities.entities:\n",
        "        response = graph.query(\n",
        "            \"\"\"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\n",
        "            YIELD node,score\n",
        "            CALL {\n",
        "            WITH node\n",
        "            MATCH (node)-[r:!MENTIONS]->(neighbor)\n",
        "            RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\n",
        "            UNION ALL\n",
        "            WITH node\n",
        "            MATCH (node)<-[r:!MENTIONS]-(neighbor)\n",
        "            RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\n",
        "            }\n",
        "            RETURN output LIMIT 20\n",
        "            \"\"\",\n",
        "            {\"query\": generate_full_text_query(entity.value)},  # <-- FIXED\n",
        "        )\n",
        "        result += \"\\n\".join([el['output'] for el in response])\n",
        "\n",
        "    return result"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 49,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "y85P76SKKzsG",
        "outputId": "702e19e7-1a08-4fc2-85f9-749808868626"
      },
      "outputs": [
        {
          "name": "stderr",
          "output_type": "stream",
          "text": [
            "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (node, node) { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n            WITH node\\n            MATCH (node)-[r:!MENTIONS]->(neighbor)\\n            RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n            UNION ALL\\n            WITH node\\n            MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n            RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output LIMIT 20\\n            \"\n",
            "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (node, node) { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n            WITH node\\n            MATCH (node)-[r:!MENTIONS]->(neighbor)\\n            RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n            UNION ALL\\n            WITH node\\n            MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n            RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output LIMIT 20\\n            \"\n"
          ]
        },
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "C - TACKLES -> Literature\n",
            "A - TACKLES -> Literature\n",
            "B - TACKLES -> Literature\n",
            "B - EXCELS_IN -> Literature\n",
            "B - HAS_CHARACTERISTIC -> excels in Literature\n"
          ]
        }
      ],
      "source": [
        "print(graph_retriever(\"who learn both Maths and Literature subjects\"))"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "iaXlDNGf87G0"
      },
      "source": [
        "### Semantic Search Retriever"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 51,
      "metadata": {
        "id": "Qw8o2tXhJORQ"
      },
      "outputs": [],
      "source": [
        "from langchain_community.vectorstores import Neo4jVector\n",
        "\n",
        "vector_index = Neo4jVector.from_existing_graph(\n",
        "    embedding,\n",
        "    search_type=\"hybrid\",\n",
        "    node_label=\"Document\",\n",
        "    text_node_properties=[\"text\"],\n",
        "    embedding_node_property=\"embedding\"\n",
        ")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 52,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "_9Lj-s8CGWNd",
        "outputId": "539465a4-b842-42b3-c390-cb7529780739"
      },
      "outputs": [
        {
          "name": "stderr",
          "output_type": "stream",
          "text": [
            "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL () { ... }} {position: line: 1, column: 1, offset: 0} for query: \"CALL { CALL db.index.vector.queryNodes($index, $k, $embedding) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS max UNWIND nodes AS n RETURN n.node AS node, (n.score / max) AS score UNION CALL db.index.fulltext.queryNodes($keyword_index, $query, {limit: $k}) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS max UNWIND nodes AS n RETURN n.node AS node, (n.score / max) AS score } WITH node, max(score) AS score ORDER BY score DESC LIMIT $k RETURN reduce(str='', k IN ['text'] | str + '\\\\n' + k + ': ' + coalesce(node[k], '')) AS text, node {.*, `embedding`: Null, id: Null, `text`: Null} AS metadata, score\"\n"
          ]
        },
        {
          "data": {
            "text/plain": [
              "[Document(metadata={}, page_content='\\ntext: offering real-world examples to connect ideas from X and Y, making both subjects more relatable. Their collaboration not only enhances their learning but fosters a sense of camaraderie, demonstrating the power of teamwork in overcoming challenges.'),\n",
              " Document(metadata={}, page_content='\\ntext: C, a generalist, performs decently in both subjects but often bridges gaps between A and B. While A helps B understand mathematical concepts, B guides A through essay writing. Meanwhile, C organizes group study sessions, offering real-world examples')]"
            ]
          },
          "execution_count": 52,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "vector_index.similarity_search(\"who learn both X and Y subjects\", k=2)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 53,
      "metadata": {
        "id": "q5XCbyPYK4cE"
      },
      "outputs": [],
      "source": [
        "def retriever(question):\n",
        "    graph_search_result = graph_retriever(question)\n",
        "    semantic_search_result = [data.page_content for data in vector_index.similarity_search(question, k=2)]\n",
        "    final_data = f\"Graph data:{graph_search_result}\\nText data:{' '. join(semantic_search_result)}\"\n",
        "    return final_data"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "M0FAHnGuOzed"
      },
      "source": [
        "### Define Prompt Template for RAG"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 55,
      "metadata": {
        "id": "f_8XTsDZMkHj"
      },
      "outputs": [],
      "source": [
        "from langchain_core.prompts import ChatPromptTemplate\n",
        "\n",
        "prompt = ChatPromptTemplate.from_messages(\n",
        "    [\n",
        "        (\n",
        "            \"system\",\"Answer this question using the provided context only.\",\n",
        "        ),\n",
        "        (\n",
        "            \"human\",\"Context: {context}\"\n",
        "            \"Question: {question}\",\n",
        "        ),\n",
        "    ]\n",
        ")"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "Wx5rRv_RO6le"
      },
      "source": [
        "### Create RAG Chain"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "PeinHlcuLXdS"
      },
      "outputs": [],
      "source": [
        "from langchain_core.runnables import RunnablePassthrough\n",
        "\n",
        "chain = (\n",
        "    {\n",
        "      \"context\": retriever,\n",
        "      \"question\": RunnablePassthrough()\n",
        "    }\n",
        "    | prompt\n",
        "    | llm\n",
        ")\n"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "LI7ZX-5xO_Us"
      },
      "source": [
        "### Invoke RAG Chain with Example Questions"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 57,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "FuAdFYBFLhXP",
        "outputId": "35c4db91-7f4c-4c5d-f421-53c73101c46a"
      },
      "outputs": [
        {
          "name": "stderr",
          "output_type": "stream",
          "text": [
            "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (node, node) { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n            WITH node\\n            MATCH (node)-[r:!MENTIONS]->(neighbor)\\n            RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n            UNION ALL\\n            WITH node\\n            MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n            RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output LIMIT 20\\n            \"\n",
            "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (node, node) { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n            WITH node\\n            MATCH (node)-[r:!MENTIONS]->(neighbor)\\n            RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n            UNION ALL\\n            WITH node\\n            MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n            RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output LIMIT 20\\n            \"\n",
            "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL () { ... }} {position: line: 1, column: 1, offset: 0} for query: \"CALL { CALL db.index.vector.queryNodes($index, $k, $embedding) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS max UNWIND nodes AS n RETURN n.node AS node, (n.score / max) AS score UNION CALL db.index.fulltext.queryNodes($keyword_index, $query, {limit: $k}) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS max UNWIND nodes AS n RETURN n.node AS node, (n.score / max) AS score } WITH node, max(score) AS score ORDER BY score DESC LIMIT $k RETURN reduce(str='', k IN ['text'] | str + '\\\\n' + k + ': ' + coalesce(node[k], '')) AS text, node {.*, `embedding`: Null, id: Null, `text`: Null} AS metadata, score\"\n"
          ]
        },
        {
          "ename": "AttributeError",
          "evalue": "'str' object has no attribute 'content'",
          "output_type": "error",
          "traceback": [
            "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
            "\u001b[31mAttributeError\u001b[39m                            Traceback (most recent call last)",
            "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[57]\u001b[39m\u001b[32m, line 3\u001b[39m\n\u001b[32m      1\u001b[39m response = chain.invoke(\u001b[33m\"\u001b[39m\u001b[33mwho learn both X and Y subjects\u001b[39m\u001b[33m\"\u001b[39m)\n\u001b[32m----> \u001b[39m\u001b[32m3\u001b[39m \u001b[38;5;28mprint\u001b[39m(\u001b[43mresponse\u001b[49m\u001b[43m.\u001b[49m\u001b[43mcontent\u001b[49m)\n",
            "\u001b[31mAttributeError\u001b[39m: 'str' object has no attribute 'content'"
          ]
        }
      ],
      "source": [
        "response = chain.invoke(\"who learn both X and Y subjects\")\n",
        "\n",
        "print(response.content)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "y1vYfSxm5SLk",
        "outputId": "92c6fff8-33c3-49e6-b1be-84db84258327"
      },
      "outputs": [
        {
          "name": "stderr",
          "output_type": "stream",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (node, node) { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n              WITH node\\n              MATCH (node)-[r:!MENTIONS]->(neighbor)\\n              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n              UNION ALL\\n              WITH node\\n              MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output LIMIT 20\\n            \"\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (node, node) { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n              WITH node\\n              MATCH (node)-[r:!MENTIONS]->(neighbor)\\n              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n              UNION ALL\\n              WITH node\\n              MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output LIMIT 20\\n            \"\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL () { ... }} {position: line: 1, column: 1, offset: 0} for query: \"CALL { CALL db.index.vector.queryNodes($index, $k, $embedding) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS max UNWIND nodes AS n RETURN n.node AS node, (n.score / max) AS score UNION CALL db.index.fulltext.queryNodes($keyword_index, $query, {limit: $k}) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS max UNWIND nodes AS n RETURN n.node AS node, (n.score / max) AS score } WITH node, max(score) AS score ORDER BY score DESC LIMIT $k RETURN reduce(str='', k IN ['text'] | str + '\\\\n' + k + ': ' + coalesce(node[k], '')) AS text, node {.*, `embedding`: Null, id: Null, `text`: Null} AS metadata, score\"\n"
          ]
        },
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "The students in that school are A, B, and C.\n"
          ]
        }
      ],
      "source": [
        "response = chain.invoke(\"who are the students in that school\")\n",
        "\n",
        "print(response.content)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 62,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "3.11.0 (main, Oct 24 2022, 18:26:48) [MSC v.1933 64 bit (AMD64)]\n"
          ]
        }
      ],
      "source": [
        "import sys\n",
        "print(sys.version)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [],
      "source": []
    }
  ],
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.11.0"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}
